{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|system|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|context|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|query|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": "\\s+"
    },
    "behavior": "Removed",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<|context|>": {
        "id": "<|context|>",
        "ids": [
          1
        ],
        "tokens": [
          "<|context|>"
        ]
      },
      "<|endoftext|>": {
        "id": "<|endoftext|>",
        "ids": [
          3
        ],
        "tokens": [
          "<|endoftext|>"
        ]
      },
      "<|query|>": {
        "id": "<|query|>",
        "ids": [
          2
        ],
        "tokens": [
          "<|query|>"
        ]
      },
      "<|system|>": {
        "id": "<|system|>",
        "ids": [
          0
        ],
        "tokens": [
          "<|system|>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|system|>": 0,
      "<|context|>": 1,
      "<|query|>": 2,
      "<|endoftext|>": 3,
      " ": 4,
      "-": 5,
      ".": 6,
      "/": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      ":": 18,
      "A": 19,
      "B": 20,
      "C": 21,
      "D": 22,
      "E": 23,
      "F": 24,
      "H": 25,
      "I": 26,
      "M": 27,
      "O": 28,
      "P": 29,
      "R": 30,
      "S": 31,
      "U": 32,
      "V": 33,
      "W": 34,
      "\\": 35,
      "a": 36,
      "b": 37,
      "c": 38,
      "d": 39,
      "e": 40,
      "f": 41,
      "g": 42,
      "h": 43,
      "i": 44,
      "k": 45,
      "l": 46,
      "m": 47,
      "n": 48,
      "o": 49,
      "p": 50,
      "r": 51,
      "s": 52,
      "t": 53,
      "u": 54,
      "v": 55,
      "w": 56,
      "x": 57,
      "y": 58,
      "00": 59,
      "d ": 60,
      "e ": 61,
      "h ": 62,
      "on": 63,
      "5 ": 64,
      "at": 65,
      "ed ": 66,
      "in": 67,
      "s ": 68,
      ".0": 69,
      ".1": 70,
      "34": 71,
      "98": 72,
      "ac": 73,
      "do": 74,
      "ec": 75,
      "er": 76,
      "om": 77,
      "st": 78,
      "us": 79,
      "on ": 80,
      "-2": 81,
      "12": 82,
      "15": 83,
      "24": 84,
      "56": 85,
      "84": 86,
      "al": 87,
      "ha": 88,
      "il": 89,
      "it": 90,
      "lo": 91,
      "re ": 92,
      "y ": 93,
      " .": 94,
      " s": 95,
      "-12": 96,
      ".5": 97,
      "/b": 98,
      "08": 99,
      "0x": 100,
      "19": 101,
      "2.": 102,
      "41": 103,
      "5a": 104,
      ":0": 105,
      ":8": 106,
      ":00": 107,
      "CV": 108,
      "E-2": 109,
      "a2": 110,
      "ab": 111,
      "af": 112,
      "an": 113,
      "are ": 114,
      "b0": 115,
      "b2": 116,
      "b8": 117,
      "be": 118,
      "cd": 119,
      "ch": 120,
      "d6": 121,
      "de": 122,
      "e.": 123,
      "en": 124,
      "et": 125,
      "ev": 126,
      "ex": 127,
      "f4": 128,
      "f00": 129,
      "fec": 130,
      "is": 131,
      "ion ": 132,
      "or": 133,
      "re": 134,
      "ro": 135,
      "sh ": 136,
      "ts ": 137,
      "ul": 138,
      "wit": 139,
      "ware ": 140,
      "ed s": 141,
      ".100": 142,
      "ack": 143,
      "dow": 144,
      "str": 145,
      "hash ": 146,
      "-1234": 147,
      "192": 148,
      ":0000": 149,
      "CVE-2": 150,
      "affec": 151,
      "with ": 152,
      "CVE-20": 153,
      "affects ": 154,
      " /": 155,
      " 1": 156,
      " 2": 157,
      " U": 158,
      " c": 159,
      " d": 160,
      " f": 161,
      " p": 162,
      " 84": 163,
      " 0x": 164,
      " ev": 165,
      " re": 166,
      " str": 167,
      " hash ": 168,
      " with ": 169,
      " CVE-20": 170,
      " affects ": 171,
      "-c": 172,
      ".2.": 173,
      ".ex": 174,
      "/s": 175,
      "/us": 176,
      "/lo": 177,
      "/et": 178,
      "04": 179,
      "0:": 180,
      "0c": 181,
      "0.0": 182,
      "015": 183,
      "0 s": 184,
      "18": 185,
      "198": 186,
      "1:0": 187,
      "1b2": 188,
      "1.100": 189,
      "1-1234": 190,
      "22": 191,
      "27": 192,
      "2\\": 193,
      "21-1234": 194,
      "3.": 195,
      "37": 196,
      "3b": 197,
      "334": 198,
      "3de": 199,
      "3:0000": 200,
      "32\\": 201,
      "44": 202,
      "424": 203,
      "43.": 204,
      "59": 205,
      "55a": 206,
      "68": 207,
      "6d": 208,
      "6 2": 209,
      "60 s": 210,
      "7d6": 211,
      "7 affects ": 212,
      "7334": 213,
      "8cd": 214,
      "86d": 215,
      "9f": 216,
      "998": 217,
      ":\\": 218,
      "At": 219,
      "A-2": 220,
      "Bre": 221,
      "C re": 222,
      "C:\\": 223,
      "D5 ": 224,
      "Dom": 225,
      "Fil": 226,
      "HA-2": 227,
      "IO": 228,
      "IP": 229,
      "Mal": 230,
      "MD5 ": 231,
      "Ran": 232,
      "Sy": 233,
      "SHA-2": 234,
      "Vul": 235,
      "Win": 236,
      "\\Sy": 237,
      "aa": 238,
      "ad": 239,
      "ag": 240,
      "ay": 241,
      "ad ": 242,
      "ain": 243,
      "a08": 244,
      "a U": 245,
      "a3b": 246,
      "bn": 247,
      "bal": 248,
      "ci": 249,
      "co": 250,
      "cr": 251,
      "c12": 252,
      "c15": 253,
      "cal": 254,
      "c/s": 255,
      "c7d6": 256,
      "dat": 257,
      "ds ": 258,
      "d41": 259,
      "db8": 260,
      "dis": 261,
      "d015": 262,
      "d8cd": 263,
      "ef": 264,
      "em": 265,
      "es ": 266,
      "e98": 267,
      "e:0": 268,
      "eaa": 269,
      "f84": 270,
      "f1b2": 271,
      "feaa": 272,
      "gi": 273,
      "gn": 274,
      "glo": 275,
      "ged s": 276,
      "g 0x": 277,
      "hex": 278,
      "ip": 279,
      "ix": 280,
      "ia U": 281,
      "ici": 282,
      "ign": 283,
      "ly": 284,
      "le ": 285,
      "lag": 286,
      "mat": 287,
      "mul": 288,
      "ner": 289,
      "nix": 290,
      "ost": 291,
      "ous": 292,
      "pp": 293,
      "pr": 294,
      "pt": 295,
      "por": 296,
      "pay": 297,
      "pdat": 298,
      "pici": 299,
      "rs ": 300,
      "r/lo": 301,
      "s.": 302,
      "sv": 303,
      "som": 304,
      "s\\Sy": 305,
      "tin": 306,
      "tack": 307,
      "t 84": 308,
      "tip": 309,
      "ure ": 310,
      "ubn": 311,
      "updat": 312,
      "utin": 313,
      "ver": 314,
      "ven": 315,
      "v6 2": 316,
      "via U": 317,
      "ypt": 318,
      "001:0": 319,
      "00998": 320,
      "d 198": 321,
      "e .": 322,
      "e /us": 323,
      "e mat": 324,
      "h /et": 325,
      "h dis": 326,
      "onion ": 327,
      "onds ": 328,
      "5 an": 329,
      "5 en": 330,
      "5 affects ": 331,
      "5 via U": 332,
      "at 1": 333,
      "ature ": 334,
      "ath /et": 335,
      "ed with ": 336,
      "ed MD5 ": 337,
      "ed at 1": 338,
      "in/b": 339,
      "ing 0x": 340,
      ".0.5": 341,
      ".0 /": 342,
      ".0.2.": 343,
      ".1.100": 344,
      ".168": 345,
      "3444": 346,
      "98f00": 347,
      "acon ": 348,
      "ach dis": 349,
      "door": 350,
      "dors ": 351,
      "ecf84": 352,
      "econds ": 353,
      "ery ": 354,
      "er CVE-20": 355,
      "omis": 356,
      "ompr": 357,
      "stem": 358,
      "uses ": 359,
      "uspici": 360,
      "on por": 361,
      "15d6": 362,
      "24 s": 363,
      "24-1234": 364,
      "56.": 365,
      "56 hash ": 366,
      "567 affects ": 367,
      "84c7d6": 368,
      "hadow": 369,
      "ilit": 370,
      "il-c": 371,
      "load ": 372,
      "y CVE-20": 373,
      "y updat": 374,
      ".51.100": 375,
      "/bin/b": 376,
      "0818": 377,
      "0xde": 378,
      "2.onion ": 379,
      "41424": 380,
      "5a3:0000": 381,
      ":8a2": 382,
      ":85a3:0000": 383,
      "a2feaa": 384,
      "abc12": 385,
      "abilit": 386,
      "b0b8": 387,
      "b0f00": 388,
      "b204": 389,
      "beef": 390,
      "beacon ": 391,
      "cd15d6": 392,
      "ched s": 393,
      "chost": 394,
      "ets.": 395,
      "every ": 396,
      "f4f1b2": 397,
      "f456.": 398,
      "ion ro": 399,
      "ropp": 400,
      "ware C:\\": 401,
      "ware pay": 402,
      "ackdoor": 403,
      "dows\\Sy": 404,
      "stry updat": 405,
      "hash abc12": 406,
      "192.0.2.": 407,
      "192.168": 408,
      ":0000:8a2": 409,
      " compr": 410,
      " dropp": 411,
      " flag": 412,
      " path /et": 413,
      " evil-c": 414,
      " string 0x": 415,
      " with hash abc12": 416,
      ".exe mat": 417,
      "0:7334": 418,
      "0c55a": 419,
      "0.0.0.5": 420,
      "22cd15d6": 421,
      "27e .": 422,
      "21-1234567 affects ": 423,
      "370:7334": 424,
      "3def456.": 425,
      "32\\sv": 426,
      "59a2feaa": 427,
      "60 seconds ": 428,
      "86d0818": 429,
      "9f86d0818": 430,
      "Attack": 431,
      "Breach dis": 432,
      "C regi": 433,
      "Domain": 434,
      "File /us": 435,
      "IOC regi": 436,
      "IPv6 2": 437,
      "Malware C:\\": 438,
      "Ransom": 439,
      "SHA-256 hash ": 440,
      "Vulner": 441,
      "Windows\\Sy": 442,
      "adbeef": 443,
      "a08 .": 444,
      "a3bf4f1b2": 445,
      "bally": 446,
      "cover": 447,
      "crypt": 448,
      "c15b0f00": 449,
      "cal/bin/b": 450,
      "c/shadow": 451,
      "d41d8cd": 452,
      "db8:85a3:0000": 453,
      "d015a3bf4f1b2": 454,
      "e9800998": 455,
      "e:0370:7334": 456,
      "globally": 457,
      "ged suspici": 458,
      "hex string 0x": 459,
      "ignature ": 460,
      "le ven": 461,
      "multip": 462,
      "nix path /et": 463,
      "ous.": 464,
      "r/local/bin/b": 465,
      "t 8443.": 466,
      "ubnets.": 467,
      "utine.": 468,
      "001:0db8:85a3:0000": 469,
      "d 198.51.100": 470,
      "5 and 198.51.100": 471,
      "5 encrypt": 472,
      "5 affects 192.168": 473,
      "5 via Unix path /et": 474,
      "ed with 192.0.2.": 475,
      "ed MD5 d41d8cd": 476,
      "ed at 10.0.0.5": 477,
      ".0 /24 s": 478,
      ".1.100 with hash abc12": 479,
      "34445 encrypt": 480,
      "98f00b204": 481,
      "dors globally": 482,
      "ecf8427e .": 483,
      "er CVE-2024-1234": 484,
      "omise.": 485,
      "stem32\\sv": 486,
      "uses hex string 0x": 487,
      "on port 8443.": 488,
      "84c7d659a2feaa": 489,
      "load uses hex string 0x": 490,
      "y CVE-2021-1234567 affects ": 491,
      "0xdeadbeef": 492,
      "2.onion beacon ": 493,
      "4142434445 encrypt": 494,
      "ability CVE-2021-1234567 affects ": 495,
      "b0b822cd15d6": 496,
      "ched signature ": 497,
      "chost.exe mat": 498,
      "every 60 seconds ": 499,
      "ion routine.": 500,
      "ware payload uses hex string 0x": 501,
      "ackdoor dropp": 502,
      "stry updated with 192.0.2.": 503,
      ":0000:8a2e:0370:7334": 504,
      " compromise.": 505,
      " flagged suspici": 506,
      " evil-c2.onion beacon ": 507,
      "0c55ad015a3bf4f1b2": 508,
      "9f86d081884c7d659a2feaa": 509,
      "Attacker CVE-2024-1234": 510,
      "Breach discover": 511,
      "Domain evil-c2.onion beacon ": 512,
      "File /usr/local/bin/b": 513,
      "IOC registry updated with 192.0.2.": 514,
      "IPv6 2001:0db8:85a3:0000": 515,
      "Malware C:\\Windows\\Sy": 516,
      "Ransomware payload uses hex string 0x": 517,
      "SHA-256 hash 9f86d081884c7d659a2feaa": 518,
      "Vulnerability CVE-2021-1234567 affects ": 519,
      "c15b0f00a08 .": 520,
      "c/shadow compromise.": 521,
      "e9800998ecf8427e .": 522,
      "le vendors globally": 523,
      "multiple vendors globally": 524,
      "5 and 198.51.100.0 /24 s": 525,
      "5 affects 192.168.1.100 with hash abc12": 526,
      "5 via Unix path /etc/shadow compromise.": 527,
      "ed MD5 d41d8cd98f00b204": 528,
      "ed at 10.0.0.55 via Unix path /etc/shadow compromise.": 529,
      "stem32\\svchost.exe mat": 530,
      "0xdeadbeef .": 531,
      "4142434445 encryption routine.": 532,
      "b0b822cd15d6c15b0f00a08 .": 533,
      "ched signature 0xdeadbeef .": 534,
      "every 60 seconds on port 8443.": 535,
      "ackdoor dropped MD5 d41d8cd98f00b204": 536,
      ":0000:8a2e:0370:7334 flagged suspici": 537,
      "0c55ad015a3bf4f1b2b0b822cd15d6c15b0f00a08 .": 538,
      "Attacker CVE-2024-12345 affects 192.168.1.100 with hash abc12": 539,
      "Breach discovered at 10.0.0.55 via Unix path /etc/shadow compromise.": 540,
      "Domain evil-c2.onion beacon every 60 seconds on port 8443.": 541,
      "File /usr/local/bin/backdoor dropped MD5 d41d8cd98f00b204": 542,
      "IOC registry updated with 192.0.2.5 and 198.51.100.0 /24 s": 543,
      "IPv6 2001:0db8:85a3:0000:0000:8a2e:0370:7334 flagged suspici": 544,
      "Malware C:\\Windows\\System32\\svchost.exe mat": 545,
      "Ransomware payload uses hex string 0x4142434445 encryption routine.": 546,
      "SHA-256 hash 9f86d081884c7d659a2feaa0c55ad015a3bf4f1b2b0b822cd15d6c15b0f00a08 .": 547,
      "Vulnerability CVE-2021-1234567 affects multiple vendors globally": 548,
      "Attacker CVE-2024-12345 affects 192.168.1.100 with hash abc123def456.": 549,
      "File /usr/local/bin/backdoor dropped MD5 d41d8cd98f00b204e9800998ecf8427e .": 550,
      "IOC registry updated with 192.0.2.5 and 198.51.100.0 /24 subnets.": 551,
      "IPv6 2001:0db8:85a3:0000:0000:8a2e:0370:7334 flagged suspicious.": 552,
      "Malware C:\\Windows\\System32\\svchost.exe matched signature 0xdeadbeef .": 553,
      "Vulnerability CVE-2021-1234567 affects multiple vendors globally.": 554
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "d",
        " "
      ],
      [
        "e",
        " "
      ],
      [
        "h",
        " "
      ],
      [
        "o",
        "n"
      ],
      [
        "5",
        " "
      ],
      [
        "a",
        "t"
      ],
      [
        "e",
        "d "
      ],
      [
        "i",
        "n"
      ],
      [
        "s",
        " "
      ],
      [
        ".",
        "0"
      ],
      [
        ".",
        "1"
      ],
      [
        "3",
        "4"
      ],
      [
        "9",
        "8"
      ],
      [
        "a",
        "c"
      ],
      [
        "d",
        "o"
      ],
      [
        "e",
        "c"
      ],
      [
        "e",
        "r"
      ],
      [
        "o",
        "m"
      ],
      [
        "s",
        "t"
      ],
      [
        "u",
        "s"
      ],
      [
        "on",
        " "
      ],
      [
        "-",
        "2"
      ],
      [
        "1",
        "2"
      ],
      [
        "1",
        "5"
      ],
      [
        "2",
        "4"
      ],
      [
        "5",
        "6"
      ],
      [
        "8",
        "4"
      ],
      [
        "a",
        "l"
      ],
      [
        "h",
        "a"
      ],
      [
        "i",
        "l"
      ],
      [
        "i",
        "t"
      ],
      [
        "l",
        "o"
      ],
      [
        "r",
        "e "
      ],
      [
        "y",
        " "
      ],
      [
        " ",
        "."
      ],
      [
        " ",
        "s"
      ],
      [
        "-",
        "12"
      ],
      [
        ".",
        "5"
      ],
      [
        "/",
        "b"
      ],
      [
        "0",
        "8"
      ],
      [
        "0",
        "x"
      ],
      [
        "1",
        "9"
      ],
      [
        "2",
        "."
      ],
      [
        "4",
        "1"
      ],
      [
        "5",
        "a"
      ],
      [
        ":",
        "0"
      ],
      [
        ":",
        "8"
      ],
      [
        ":",
        "00"
      ],
      [
        "C",
        "V"
      ],
      [
        "E",
        "-2"
      ],
      [
        "a",
        "2"
      ],
      [
        "a",
        "b"
      ],
      [
        "a",
        "f"
      ],
      [
        "a",
        "n"
      ],
      [
        "a",
        "re "
      ],
      [
        "b",
        "0"
      ],
      [
        "b",
        "2"
      ],
      [
        "b",
        "8"
      ],
      [
        "b",
        "e"
      ],
      [
        "c",
        "d"
      ],
      [
        "c",
        "h"
      ],
      [
        "d",
        "6"
      ],
      [
        "d",
        "e"
      ],
      [
        "e",
        "."
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "t"
      ],
      [
        "e",
        "v"
      ],
      [
        "e",
        "x"
      ],
      [
        "f",
        "4"
      ],
      [
        "f",
        "00"
      ],
      [
        "f",
        "ec"
      ],
      [
        "i",
        "s"
      ],
      [
        "i",
        "on "
      ],
      [
        "o",
        "r"
      ],
      [
        "r",
        "e"
      ],
      [
        "r",
        "o"
      ],
      [
        "s",
        "h "
      ],
      [
        "t",
        "s "
      ],
      [
        "u",
        "l"
      ],
      [
        "w",
        "it"
      ],
      [
        "w",
        "are "
      ],
      [
        "ed ",
        "s"
      ],
      [
        ".1",
        "00"
      ],
      [
        "ac",
        "k"
      ],
      [
        "do",
        "w"
      ],
      [
        "st",
        "r"
      ],
      [
        "ha",
        "sh "
      ],
      [
        "-12",
        "34"
      ],
      [
        "19",
        "2"
      ],
      [
        ":00",
        "00"
      ],
      [
        "CV",
        "E-2"
      ],
      [
        "af",
        "fec"
      ],
      [
        "wit",
        "h "
      ],
      [
        "CVE-2",
        "0"
      ],
      [
        "affec",
        "ts "
      ],
      [
        " ",
        "/"
      ],
      [
        " ",
        "1"
      ],
      [
        " ",
        "2"
      ],
      [
        " ",
        "U"
      ],
      [
        " ",
        "c"
      ],
      [
        " ",
        "d"
      ],
      [
        " ",
        "f"
      ],
      [
        " ",
        "p"
      ],
      [
        " ",
        "84"
      ],
      [
        " ",
        "0x"
      ],
      [
        " ",
        "ev"
      ],
      [
        " ",
        "re"
      ],
      [
        " ",
        "str"
      ],
      [
        " ",
        "hash "
      ],
      [
        " ",
        "with "
      ],
      [
        " ",
        "CVE-20"
      ],
      [
        " ",
        "affects "
      ],
      [
        "-",
        "c"
      ],
      [
        ".",
        "2."
      ],
      [
        ".",
        "ex"
      ],
      [
        "/",
        "s"
      ],
      [
        "/",
        "us"
      ],
      [
        "/",
        "lo"
      ],
      [
        "/",
        "et"
      ],
      [
        "0",
        "4"
      ],
      [
        "0",
        ":"
      ],
      [
        "0",
        "c"
      ],
      [
        "0",
        ".0"
      ],
      [
        "0",
        "15"
      ],
      [
        "0",
        " s"
      ],
      [
        "1",
        "8"
      ],
      [
        "1",
        "98"
      ],
      [
        "1",
        ":0"
      ],
      [
        "1",
        "b2"
      ],
      [
        "1",
        ".100"
      ],
      [
        "1",
        "-1234"
      ],
      [
        "2",
        "2"
      ],
      [
        "2",
        "7"
      ],
      [
        "2",
        "\\"
      ],
      [
        "2",
        "1-1234"
      ],
      [
        "3",
        "."
      ],
      [
        "3",
        "7"
      ],
      [
        "3",
        "b"
      ],
      [
        "3",
        "34"
      ],
      [
        "3",
        "de"
      ],
      [
        "3",
        ":0000"
      ],
      [
        "3",
        "2\\"
      ],
      [
        "4",
        "4"
      ],
      [
        "4",
        "24"
      ],
      [
        "4",
        "3."
      ],
      [
        "5",
        "9"
      ],
      [
        "5",
        "5a"
      ],
      [
        "6",
        "8"
      ],
      [
        "6",
        "d"
      ],
      [
        "6",
        " 2"
      ],
      [
        "6",
        "0 s"
      ],
      [
        "7",
        "d6"
      ],
      [
        "7",
        " affects "
      ],
      [
        "7",
        "334"
      ],
      [
        "8",
        "cd"
      ],
      [
        "8",
        "6d"
      ],
      [
        "9",
        "f"
      ],
      [
        "9",
        "98"
      ],
      [
        ":",
        "\\"
      ],
      [
        "A",
        "t"
      ],
      [
        "A",
        "-2"
      ],
      [
        "B",
        "re"
      ],
      [
        "C",
        " re"
      ],
      [
        "C",
        ":\\"
      ],
      [
        "D",
        "5 "
      ],
      [
        "D",
        "om"
      ],
      [
        "F",
        "il"
      ],
      [
        "H",
        "A-2"
      ],
      [
        "I",
        "O"
      ],
      [
        "I",
        "P"
      ],
      [
        "M",
        "al"
      ],
      [
        "M",
        "D5 "
      ],
      [
        "R",
        "an"
      ],
      [
        "S",
        "y"
      ],
      [
        "S",
        "HA-2"
      ],
      [
        "V",
        "ul"
      ],
      [
        "W",
        "in"
      ],
      [
        "\\",
        "Sy"
      ],
      [
        "a",
        "a"
      ],
      [
        "a",
        "d"
      ],
      [
        "a",
        "g"
      ],
      [
        "a",
        "y"
      ],
      [
        "a",
        "d "
      ],
      [
        "a",
        "in"
      ],
      [
        "a",
        "08"
      ],
      [
        "a",
        " U"
      ],
      [
        "a",
        "3b"
      ],
      [
        "b",
        "n"
      ],
      [
        "b",
        "al"
      ],
      [
        "c",
        "i"
      ],
      [
        "c",
        "o"
      ],
      [
        "c",
        "r"
      ],
      [
        "c",
        "12"
      ],
      [
        "c",
        "15"
      ],
      [
        "c",
        "al"
      ],
      [
        "c",
        "/s"
      ],
      [
        "c",
        "7d6"
      ],
      [
        "d",
        "at"
      ],
      [
        "d",
        "s "
      ],
      [
        "d",
        "41"
      ],
      [
        "d",
        "b8"
      ],
      [
        "d",
        "is"
      ],
      [
        "d",
        "015"
      ],
      [
        "d",
        "8cd"
      ],
      [
        "e",
        "f"
      ],
      [
        "e",
        "m"
      ],
      [
        "e",
        "s "
      ],
      [
        "e",
        "98"
      ],
      [
        "e",
        ":0"
      ],
      [
        "e",
        "aa"
      ],
      [
        "f",
        "84"
      ],
      [
        "f",
        "1b2"
      ],
      [
        "f",
        "eaa"
      ],
      [
        "g",
        "i"
      ],
      [
        "g",
        "n"
      ],
      [
        "g",
        "lo"
      ],
      [
        "g",
        "ed s"
      ],
      [
        "g",
        " 0x"
      ],
      [
        "h",
        "ex"
      ],
      [
        "i",
        "p"
      ],
      [
        "i",
        "x"
      ],
      [
        "i",
        "a U"
      ],
      [
        "i",
        "ci"
      ],
      [
        "i",
        "gn"
      ],
      [
        "l",
        "y"
      ],
      [
        "l",
        "e "
      ],
      [
        "l",
        "ag"
      ],
      [
        "m",
        "at"
      ],
      [
        "m",
        "ul"
      ],
      [
        "n",
        "er"
      ],
      [
        "n",
        "ix"
      ],
      [
        "o",
        "st"
      ],
      [
        "o",
        "us"
      ],
      [
        "p",
        "p"
      ],
      [
        "p",
        "r"
      ],
      [
        "p",
        "t"
      ],
      [
        "p",
        "or"
      ],
      [
        "p",
        "ay"
      ],
      [
        "p",
        "dat"
      ],
      [
        "p",
        "ici"
      ],
      [
        "r",
        "s "
      ],
      [
        "r",
        "/lo"
      ],
      [
        "s",
        "."
      ],
      [
        "s",
        "v"
      ],
      [
        "s",
        "om"
      ],
      [
        "s",
        "\\Sy"
      ],
      [
        "t",
        "in"
      ],
      [
        "t",
        "ack"
      ],
      [
        "t",
        " 84"
      ],
      [
        "t",
        "ip"
      ],
      [
        "u",
        "re "
      ],
      [
        "u",
        "bn"
      ],
      [
        "u",
        "pdat"
      ],
      [
        "u",
        "tin"
      ],
      [
        "v",
        "er"
      ],
      [
        "v",
        "en"
      ],
      [
        "v",
        "6 2"
      ],
      [
        "v",
        "ia U"
      ],
      [
        "y",
        "pt"
      ],
      [
        "00",
        "1:0"
      ],
      [
        "00",
        "998"
      ],
      [
        "d ",
        "198"
      ],
      [
        "e ",
        "."
      ],
      [
        "e ",
        "/us"
      ],
      [
        "e ",
        "mat"
      ],
      [
        "h ",
        "/et"
      ],
      [
        "h ",
        "dis"
      ],
      [
        "on",
        "ion "
      ],
      [
        "on",
        "ds "
      ],
      [
        "5 ",
        "an"
      ],
      [
        "5 ",
        "en"
      ],
      [
        "5 ",
        "affects "
      ],
      [
        "5 ",
        "via U"
      ],
      [
        "at",
        " 1"
      ],
      [
        "at",
        "ure "
      ],
      [
        "at",
        "h /et"
      ],
      [
        "ed ",
        "with "
      ],
      [
        "ed ",
        "MD5 "
      ],
      [
        "ed ",
        "at 1"
      ],
      [
        "in",
        "/b"
      ],
      [
        "in",
        "g 0x"
      ],
      [
        ".0",
        ".5"
      ],
      [
        ".0",
        " /"
      ],
      [
        ".0",
        ".2."
      ],
      [
        ".1",
        ".100"
      ],
      [
        ".1",
        "68"
      ],
      [
        "34",
        "44"
      ],
      [
        "98",
        "f00"
      ],
      [
        "ac",
        "on "
      ],
      [
        "ac",
        "h dis"
      ],
      [
        "do",
        "or"
      ],
      [
        "do",
        "rs "
      ],
      [
        "ec",
        "f84"
      ],
      [
        "ec",
        "onds "
      ],
      [
        "er",
        "y "
      ],
      [
        "er",
        " CVE-20"
      ],
      [
        "om",
        "is"
      ],
      [
        "om",
        "pr"
      ],
      [
        "st",
        "em"
      ],
      [
        "us",
        "es "
      ],
      [
        "us",
        "pici"
      ],
      [
        "on ",
        "por"
      ],
      [
        "15",
        "d6"
      ],
      [
        "24",
        " s"
      ],
      [
        "24",
        "-1234"
      ],
      [
        "56",
        "."
      ],
      [
        "56",
        " hash "
      ],
      [
        "56",
        "7 affects "
      ],
      [
        "84",
        "c7d6"
      ],
      [
        "ha",
        "dow"
      ],
      [
        "il",
        "it"
      ],
      [
        "il",
        "-c"
      ],
      [
        "lo",
        "ad "
      ],
      [
        "y ",
        "CVE-20"
      ],
      [
        "y ",
        "updat"
      ],
      [
        ".5",
        "1.100"
      ],
      [
        "/b",
        "in/b"
      ],
      [
        "08",
        "18"
      ],
      [
        "0x",
        "de"
      ],
      [
        "2.",
        "onion "
      ],
      [
        "41",
        "424"
      ],
      [
        "5a",
        "3:0000"
      ],
      [
        ":8",
        "a2"
      ],
      [
        ":8",
        "5a3:0000"
      ],
      [
        "a2",
        "feaa"
      ],
      [
        "ab",
        "c12"
      ],
      [
        "ab",
        "ilit"
      ],
      [
        "b0",
        "b8"
      ],
      [
        "b0",
        "f00"
      ],
      [
        "b2",
        "04"
      ],
      [
        "be",
        "ef"
      ],
      [
        "be",
        "acon "
      ],
      [
        "cd",
        "15d6"
      ],
      [
        "ch",
        "ed s"
      ],
      [
        "ch",
        "ost"
      ],
      [
        "et",
        "s."
      ],
      [
        "ev",
        "ery "
      ],
      [
        "f4",
        "f1b2"
      ],
      [
        "f4",
        "56."
      ],
      [
        "ion ",
        "ro"
      ],
      [
        "ro",
        "pp"
      ],
      [
        "ware ",
        "C:\\"
      ],
      [
        "ware ",
        "pay"
      ],
      [
        "ack",
        "door"
      ],
      [
        "dow",
        "s\\Sy"
      ],
      [
        "str",
        "y updat"
      ],
      [
        "hash ",
        "abc12"
      ],
      [
        "192",
        ".0.2."
      ],
      [
        "192",
        ".168"
      ],
      [
        ":0000",
        ":8a2"
      ],
      [
        " c",
        "ompr"
      ],
      [
        " d",
        "ropp"
      ],
      [
        " f",
        "lag"
      ],
      [
        " p",
        "ath /et"
      ],
      [
        " ev",
        "il-c"
      ],
      [
        " str",
        "ing 0x"
      ],
      [
        " with ",
        "hash abc12"
      ],
      [
        ".ex",
        "e mat"
      ],
      [
        "0:",
        "7334"
      ],
      [
        "0c",
        "55a"
      ],
      [
        "0.0",
        ".0.5"
      ],
      [
        "22",
        "cd15d6"
      ],
      [
        "27",
        "e ."
      ],
      [
        "21-1234",
        "567 affects "
      ],
      [
        "37",
        "0:7334"
      ],
      [
        "3de",
        "f456."
      ],
      [
        "32\\",
        "sv"
      ],
      [
        "59",
        "a2feaa"
      ],
      [
        "60 s",
        "econds "
      ],
      [
        "86d",
        "0818"
      ],
      [
        "9f",
        "86d0818"
      ],
      [
        "At",
        "tack"
      ],
      [
        "Bre",
        "ach dis"
      ],
      [
        "C re",
        "gi"
      ],
      [
        "Dom",
        "ain"
      ],
      [
        "Fil",
        "e /us"
      ],
      [
        "IO",
        "C regi"
      ],
      [
        "IP",
        "v6 2"
      ],
      [
        "Mal",
        "ware C:\\"
      ],
      [
        "Ran",
        "som"
      ],
      [
        "SHA-2",
        "56 hash "
      ],
      [
        "Vul",
        "ner"
      ],
      [
        "Win",
        "dows\\Sy"
      ],
      [
        "ad",
        "beef"
      ],
      [
        "a08",
        " ."
      ],
      [
        "a3b",
        "f4f1b2"
      ],
      [
        "bal",
        "ly"
      ],
      [
        "co",
        "ver"
      ],
      [
        "cr",
        "ypt"
      ],
      [
        "c15",
        "b0f00"
      ],
      [
        "cal",
        "/bin/b"
      ],
      [
        "c/s",
        "hadow"
      ],
      [
        "d41",
        "d8cd"
      ],
      [
        "db8",
        ":85a3:0000"
      ],
      [
        "d015",
        "a3bf4f1b2"
      ],
      [
        "e98",
        "00998"
      ],
      [
        "e:0",
        "370:7334"
      ],
      [
        "glo",
        "bally"
      ],
      [
        "ged s",
        "uspici"
      ],
      [
        "hex",
        " string 0x"
      ],
      [
        "ign",
        "ature "
      ],
      [
        "le ",
        "ven"
      ],
      [
        "mul",
        "tip"
      ],
      [
        "nix",
        " path /et"
      ],
      [
        "ous",
        "."
      ],
      [
        "r/lo",
        "cal/bin/b"
      ],
      [
        "t 84",
        "43."
      ],
      [
        "ubn",
        "ets."
      ],
      [
        "utin",
        "e."
      ],
      [
        "001:0",
        "db8:85a3:0000"
      ],
      [
        "d 198",
        ".51.100"
      ],
      [
        "5 an",
        "d 198.51.100"
      ],
      [
        "5 en",
        "crypt"
      ],
      [
        "5 affects ",
        "192.168"
      ],
      [
        "5 via U",
        "nix path /et"
      ],
      [
        "ed with ",
        "192.0.2."
      ],
      [
        "ed MD5 ",
        "d41d8cd"
      ],
      [
        "ed at 1",
        "0.0.0.5"
      ],
      [
        ".0 /",
        "24 s"
      ],
      [
        ".1.100",
        " with hash abc12"
      ],
      [
        "3444",
        "5 encrypt"
      ],
      [
        "98f00",
        "b204"
      ],
      [
        "dors ",
        "globally"
      ],
      [
        "ecf84",
        "27e ."
      ],
      [
        "er CVE-20",
        "24-1234"
      ],
      [
        "omis",
        "e."
      ],
      [
        "stem",
        "32\\sv"
      ],
      [
        "uses ",
        "hex string 0x"
      ],
      [
        "on por",
        "t 8443."
      ],
      [
        "84c7d6",
        "59a2feaa"
      ],
      [
        "load ",
        "uses hex string 0x"
      ],
      [
        "y CVE-20",
        "21-1234567 affects "
      ],
      [
        "0xde",
        "adbeef"
      ],
      [
        "2.onion ",
        "beacon "
      ],
      [
        "41424",
        "34445 encrypt"
      ],
      [
        "abilit",
        "y CVE-2021-1234567 affects "
      ],
      [
        "b0b8",
        "22cd15d6"
      ],
      [
        "ched s",
        "ignature "
      ],
      [
        "chost",
        ".exe mat"
      ],
      [
        "every ",
        "60 seconds "
      ],
      [
        "ion ro",
        "utine."
      ],
      [
        "ware pay",
        "load uses hex string 0x"
      ],
      [
        "ackdoor",
        " dropp"
      ],
      [
        "stry updat",
        "ed with 192.0.2."
      ],
      [
        ":0000:8a2",
        "e:0370:7334"
      ],
      [
        " compr",
        "omise."
      ],
      [
        " flag",
        "ged suspici"
      ],
      [
        " evil-c",
        "2.onion beacon "
      ],
      [
        "0c55a",
        "d015a3bf4f1b2"
      ],
      [
        "9f86d0818",
        "84c7d659a2feaa"
      ],
      [
        "Attack",
        "er CVE-2024-1234"
      ],
      [
        "Breach dis",
        "cover"
      ],
      [
        "Domain",
        " evil-c2.onion beacon "
      ],
      [
        "File /us",
        "r/local/bin/b"
      ],
      [
        "IOC regi",
        "stry updated with 192.0.2."
      ],
      [
        "IPv6 2",
        "001:0db8:85a3:0000"
      ],
      [
        "Malware C:\\",
        "Windows\\Sy"
      ],
      [
        "Ransom",
        "ware payload uses hex string 0x"
      ],
      [
        "SHA-256 hash ",
        "9f86d081884c7d659a2feaa"
      ],
      [
        "Vulner",
        "ability CVE-2021-1234567 affects "
      ],
      [
        "c15b0f00",
        "a08 ."
      ],
      [
        "c/shadow",
        " compromise."
      ],
      [
        "e9800998",
        "ecf8427e ."
      ],
      [
        "le ven",
        "dors globally"
      ],
      [
        "multip",
        "le vendors globally"
      ],
      [
        "5 and 198.51.100",
        ".0 /24 s"
      ],
      [
        "5 affects 192.168",
        ".1.100 with hash abc12"
      ],
      [
        "5 via Unix path /et",
        "c/shadow compromise."
      ],
      [
        "ed MD5 d41d8cd",
        "98f00b204"
      ],
      [
        "ed at 10.0.0.5",
        "5 via Unix path /etc/shadow compromise."
      ],
      [
        "stem32\\sv",
        "chost.exe mat"
      ],
      [
        "0xdeadbeef",
        " ."
      ],
      [
        "4142434445 encrypt",
        "ion routine."
      ],
      [
        "b0b822cd15d6",
        "c15b0f00a08 ."
      ],
      [
        "ched signature ",
        "0xdeadbeef ."
      ],
      [
        "every 60 seconds ",
        "on port 8443."
      ],
      [
        "ackdoor dropp",
        "ed MD5 d41d8cd98f00b204"
      ],
      [
        ":0000:8a2e:0370:7334",
        " flagged suspici"
      ],
      [
        "0c55ad015a3bf4f1b2",
        "b0b822cd15d6c15b0f00a08 ."
      ],
      [
        "Attacker CVE-2024-1234",
        "5 affects 192.168.1.100 with hash abc12"
      ],
      [
        "Breach discover",
        "ed at 10.0.0.55 via Unix path /etc/shadow compromise."
      ],
      [
        "Domain evil-c2.onion beacon ",
        "every 60 seconds on port 8443."
      ],
      [
        "File /usr/local/bin/b",
        "ackdoor dropped MD5 d41d8cd98f00b204"
      ],
      [
        "IOC registry updated with 192.0.2.",
        "5 and 198.51.100.0 /24 s"
      ],
      [
        "IPv6 2001:0db8:85a3:0000",
        ":0000:8a2e:0370:7334 flagged suspici"
      ],
      [
        "Malware C:\\Windows\\Sy",
        "stem32\\svchost.exe mat"
      ],
      [
        "Ransomware payload uses hex string 0x",
        "4142434445 encryption routine."
      ],
      [
        "SHA-256 hash 9f86d081884c7d659a2feaa",
        "0c55ad015a3bf4f1b2b0b822cd15d6c15b0f00a08 ."
      ],
      [
        "Vulnerability CVE-2021-1234567 affects ",
        "multiple vendors globally"
      ],
      [
        "Attacker CVE-2024-12345 affects 192.168.1.100 with hash abc12",
        "3def456."
      ],
      [
        "File /usr/local/bin/backdoor dropped MD5 d41d8cd98f00b204",
        "e9800998ecf8427e ."
      ],
      [
        "IOC registry updated with 192.0.2.5 and 198.51.100.0 /24 s",
        "ubnets."
      ],
      [
        "IPv6 2001:0db8:85a3:0000:0000:8a2e:0370:7334 flagged suspici",
        "ous."
      ],
      [
        "Malware C:\\Windows\\System32\\svchost.exe mat",
        "ched signature 0xdeadbeef ."
      ],
      [
        "Vulnerability CVE-2021-1234567 affects multiple vendors globally",
        "."
      ]
    ]
  }
}